Catalogs/бит_СтатусФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатусФизЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачислятьПоНорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНаСубсидии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроживаниеВДанныйМомент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_СтатусФизЛица/Forms/ФормаВыбораУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// БИТ_ЖКХ 18.07.2014
// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	Если Параметры.Свойство("ОткрытьИзРегистрацииПроживающих") Тогда
		
		СтатусПроживания = Параметры.ОткрытьИзРегистрацииПроживающих.СтатусПроживания;
		КэшированныеЗначения.Вставить("СтатусПроживания"                , СтатусПроживания);
	Иначе	 
		
		КэшированныеЗначения.Вставить("СтатусПроживания"                , Неопределено);
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПроживаниеВДанныйМомент = ПроживаниеВДанныйМоментНаСервере(ВыбраннаяСтрока);
	
	Если ПроживаниеВДанныйМомент и мКэшЗначений.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для статуса ""НеПроживает"" нельзя выбирать статус с флагом ""ПроживаетВДаннныйМомент""");
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПроживаниеВДанныйМоментНаСервере(СтатусФизЛица)
	
	// БИТ_ЖКХ 28.11.2014{{
	Попытка
		Возврат СтатусФизЛица.ПроживаниеВДанныйМомент;
	Исключение
		
		Если НЕ СтатусФизЛица.количество() = 0 Тогда
			Возврат СтатусФизЛица[0].ПроживаниеВДанныйМомент;
		КонецЕсли;
		
	КонецПопытки;
	// БИТ_ЖКХ 28.11.2014}}
	
КонецФункции
// БИТ_ЖКХ 18.07.2014

// БИТ_ЖКХ 24.12.2014}}
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 25.11.2016 10:28:59 Начало правки...
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		ЗначениеПроживаниеВДанныйМомент = ЗначенияНаСервере(Значение);
		Для Каждого Элт Из ЗначениеПроживаниеВДанныйМомент Цикл
			Если Элт.Значение И мКэшЗначений.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для статуса ""НеПроживает"" нельзя выбирать статус с флагом ""ПроживаетВДаннныйМомент""");
				СтандартнаяОбработка = Ложь;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ЗначениеПроживаниеВДанныйМомент = ЗначениеНаСервере(Значение);
		Если ЗначениеПроживаниеВДанныйМомент и мКэшЗначений.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для статуса ""НеПроживает"" нельзя выбирать статус с флагом ""ПроживаетВДаннныйМомент""");
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	//Если ЗначениеПроживаниеВДанныйМомент и мКэшЗначений.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает") Тогда
	//	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для статуса ""НеПроживает"" нельзя выбирать статус с флагом ""ПроживаетВДаннныйМомент""");
	//	СтандартнаяОбработка = Ложь;
	//	Возврат;
	//КонецЕсли;
	// БИТ_ЖКХ 25.11.2016 10:28:55 Конец правки. 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеНаСервере(Значение)
	
	// БИТ_ЖКХ 25.11.2016 10:17:59 Начало правки... 
	//Возврат Значение.ПроживаниеВДанныйМомент;	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "ПроживаниеВДанныйМомент");
	// БИТ_ЖКХ 25.11.2016 10:18:01 Конец правки. 
	
КонецФункции
// БИТ_ЖКХ 24.12.2014}}

// БИТ_ЖКХ 25.11.2016 11:04:09 Начало правки...
&НаСервереБезКонтекста
Функция ЗначенияНаСервере(Значение)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Значение, "ПроживаниеВДанныйМомент");
	
КонецФункции

// БИТ_ЖКХ 25.11.2016 11:04:09 Конец правки.
#КонецОбласти
